Safe_REST_API/src/InformationRegisters/кв_ЖурналВходящихHTTPЗапросов/кв_ЖурналВходящихHTTPЗапросов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>кв_ЖурналВходящихHTTPЗапросов</name>
  <resources>
    <name>КлючИдемпотентности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ресурс</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Метод</name>
    <type>
      <types>EnumRef.кв_HTTPМетоды</types>
    </type>
  </resources>
  <resources>
    <name>Запрос</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Ответ</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>КодСостояния</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВремяНачала</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерЗапроса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерОтвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДатаЗапроса</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сервис</name>
    <type>
      <types>CatalogRef.кв_Сервисы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Safe_REST_API/src/InformationRegisters/кв_ЖурналВходящихHTTPЗапросов/Forms/ФормаЗаписи/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2025, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТолькоПросмотр Тогда
		
		ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет;
		
		Элементы.ПодобныеЗапросы.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
		Элементы.ПодобныеЗапросы.ИзменятьСоставСтрок      = ЛОЖЬ;
		Элементы.ПодобныеЗапросы.ТолькоПросмотр           = ИСТИНА;
		
	КонецЕсли;
	
	ЭтоНовый = ПустаяСтрока(Запись.ИсходныйКлючЗаписи.Идентификатор);
	
	Если НЕ ЭтоНовый Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СтраницаПодобныеЗапросы.Доступность = ЛОЖЬ;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	АвтоЗаголовок = ЛОЖЬ;
	Заголовок     = СтрШаблон(НСтр("ru = '%2: %1%3'"), Запись.Сервис, Запись.Метод, Запись.Ресурс);
	
	ПоказатьПодобныеЗапросы = НЕ ПустаяСтрока(Запись.КлючИдемпотентности);
	Элементы.СтраницаПодобныеЗапросы.Доступность = ПоказатьПодобныеЗапросы;
	
	Если ПоказатьПодобныеЗапросы Тогда
		
		кв_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ПодобныеЗапросы.Отбор, "Идентификатор",
			Запись.Идентификатор, ВидСравненияКомпоновкиДанных.НеРавно);
			
		кв_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ПодобныеЗапросы.Отбор, "Сервис", Запись.Сервис);
		
		кв_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ПодобныеЗапросы.Отбор, "КлючИдемпотентности",
			Запись.КлючИдемпотентности);
		
	Иначе 
		
		кв_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ПодобныеЗапросы.Отбор, "Сервис", Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьОПрограмме(Команда)
	
	ОткрытьФорму("Справочник.кв_Сервисы.Форма.ОПрограмме",, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
